html/6_Complex_Data_Types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-24 Mon 07:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>6. Complex Data Types</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Paul Gribble" />
<link rel="stylesheet" type="text/css" href="mystyle.css" /></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="http://www.gribblelab.org/CBootCamp/index.html"> UP </a>
 |
 <a accesskey="H" href="http://www.gribblelab.org/CBootCamp/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">6. Complex Data Types</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0309012">Arrays</a>
<ul>
<li><a href="#orgc72012e">Defining an Array</a></li>
<li><a href="#org6e7a0d5">Indexing Array Elements</a></li>
<li><a href="#orgc02c77d">Assigning values to array elements</a></li>
<li><a href="#orge58da9e">Initializing Arrays</a></li>
</ul>
</li>
<li><a href="#orge2f660a">Multidimensional Arrays</a>
<ul>
<li><a href="#org40be9cf">Matrix Calculations</a></li>
</ul>
</li>
<li><a href="#org3350792">Variable-Length Arrays</a></li>
<li><a href="#orgf0645bf">Command-line arguments</a></li>
<li><a href="#org9b922d5">Structures</a>
<ul>
<li><a href="#orgb76e4e3">Using typedef to shorten structure declarations</a></li>
<li><a href="#org2d42bec">Structures Containing Arrays</a></li>
<li><a href="#org89c8410">Arrays of Structures</a></li>
</ul>
</li>
<li><a href="#orgb8b7441">Exercises</a>
<ul>
<li><a href="#org12808cf">Solutions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org0309012" class="outline-2">
<h2 id="org0309012">Arrays</h2>
<div class="outline-text-2" id="text-org0309012">
<p>
Just as in MATLAB, or Python, or any number of other high-level
languages, C provides a data structure called an <b>array</b>. An array in
C is a set of ordered items. You can think of this as a vector, a
list, etc, there are many names. Typically in C we call these an
array.
</p>
</div>

<div id="outline-container-orgc72012e" class="outline-3">
<h3 id="orgc72012e">Defining an Array</h3>
<div class="outline-text-3" id="text-orgc72012e">
<p>
As an example, let's say we want to store a list of 5 grades. We can
define an array as follows:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">5</span><span style="color: #4f97d7;">]</span>;
</pre>
</div>

<p>
This declaration says we want to set aside space in memory for 5
integer values, and we can refer to that block in memory using the
variable name "grades". Note that we have only allocated the space in
memory, we have not initialized any values of the array. Whatever
values happened to be in memory at the locations set aside when we
declared the grades variable, will still be there. We can have a look
at what is there by <b>indexing</b> into the array like this:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">5</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"grades[%d]=%d\n"</span>, i, grades<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
grades[0]=0
grades[1]=0
grades[2]=4195344
grades[3]=0
grades[4]=1247893184
</pre>

<p>
Note a couple of things.
</p>

<ol class="org-ol">
<li>The first index always starts with 0 (this is the same in Python,
but in MATLAB for example, indices start at 1).</li>

<li>The values in the array right after declaring the variable will not
be initialized, they will contain whatever values happened to be in
memory at those locations before. (You will probably see different
values when you run your code).</li>
</ol>
</div>
</div>

<div id="outline-container-org6e7a0d5" class="outline-3">
<h3 id="org6e7a0d5">Indexing Array Elements</h3>
<div class="outline-text-3" id="text-org6e7a0d5">
<p>
We have seen that array indices always start at 0 (not 1 as in
MATLAB). It's also important to know that once an array of a given
size is declared (and memory is allocated), the array size is
fixed. That is, you cannot extend the array and make it larger (or
make it smaller). We will see exceptions to this later, when we talk
about dynamically allocated memory using <code>malloc()</code>, but for now,
assume arrays are fixed in size once declared.
</p>

<p>
If we try to access an element of an array beyond its bounds, like for
example accessing the 6th element of the <code>grades</code> array defined above,
<b>C will not prevent us from doing that</b>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">5</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"grades[%d]=%d\n"</span>, i, grades<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"grades[5]=%d\n"</span>, grades<span style="color: #2d9574;">[</span><span style="color: #a45bad;">5</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"grades[500]=%d\n"</span>, grades<span style="color: #2d9574;">[</span><span style="color: #a45bad;">500</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
grades[0]=0
grades[1]=0
grades[2]=4195344
grades[3]=0
grades[4]=1247893184
grades[5]=32767
grades[500]=0
</pre>

<p>
In fact, <b>we will not even get a warning</b> from the compiler. This
highlights a general difference in approach between C and other
high-level languages (especially interpreted languages like Python and
MATLAB) &#x2014; C will do exactly what you tell it to.
</p>

<p>
To understand why asking for the 6th element of a 5-element array is
not nonsensical, we have to understand some details about how C
represents arrays in memory, and how accessing memory by indexing
arrays works in C. When you declare a variable <code>grades</code> that is a
5-element array of integers, what C actually does, is two (main)
things:
</p>

<ol class="org-ol">
<li>A consecutive block of memory is "set aside" (reserved for
use). The amount of memory that is set aside is equal to the number
of elements of the array multiplied by the size of the declared
element type. So if we declare <code>int grades[5];</code>, then 20 bytes (5 x
4 bytes) of consecutive memory is set aside.</li>

<li>The variable name <code>grades</code> is assigned to the block of memory. In
fact what actually happens, is that the variable name <code>grades</code> is
assigned a <b>pointer</b> to the address in memory corresponding to the
first element of the array (the beginning of the block of
consecutive memory that was set aside). Section 5.3 of the
Kernighan and Ritchie book will take you through this in more
detail.</li>
</ol>

<p>
Then when you index into the <code>grades</code> array, for example like
<code>grades[0]</code> or <code>grades[3]</code>, C will look at the appropriate place in
memory, defined by the beginning of the array (the <code>grades</code> <b>pointer</b>)
plus the appropriate number of "steps" into the memory block, as
defined by the index, and the size of the basic type as defined in the
original array declaration. So if you access the 3rd element of the
<code>grades</code> array with <code>grades[2]</code>, what C actually does is jumps 12
bytes (3 x 4) into the block of memory that was set aside, and reads
the value it finds there. So if you ask for the 500th element of the
array, C simply reads the memory location 500 x 4 = 2000 bytes past
the beginning of the memory block, <b>whatever that may be</b>.
</p>

<p>
As you can imagine, this lack of "protection" represents a prime
opportunity to generate programming errors that can be difficult to
debug. What's particularly dangerous however, is that this feature of
C also applies to <b>assigning</b> values to an array.
</p>
</div>
</div>
