html/6_Complex_Data_Types.html

<div id="outline-container-orgc02c77d" class="outline-3">
<h3 id="orgc02c77d">Assigning values to array elements</h3>
<div class="outline-text-3" id="text-orgc02c77d">
<p>
I can assign the integers 1 through 5 to my <code>grades</code> array like this:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">5</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    grades<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span> = i+<span style="color: #a45bad;">1</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">5</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"grades[%d]=%d\n"</span>, i, grades<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
grades[0]=1
grades[1]=2
grades[2]=3
grades[3]=4
grades[4]=5
</pre>

<p>
What can be <b>dangerous</b> however, is that I can also ask C to <b>assign</b>
values to elements beyond the bounds of my array, and <b>C won't
complain</b>:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">5</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    grades<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span> = i+<span style="color: #a45bad;">1</span>;
  <span style="color: #bc6ec5;">}</span>
  grades<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span> = <span style="color: #a45bad;">999</span>;
  grades<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">500</span><span style="color: #bc6ec5;">]</span> = <span style="color: #a45bad;">12345</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">6</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"grades[%d]=%d\n"</span>, i, grades<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"grades[500]=%d\n"</span>, grades<span style="color: #2d9574;">[</span><span style="color: #a45bad;">500</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
grades[0]=1
grades[1]=2
grades[2]=3
grades[3]=4
grades[4]=5
grades[5]=999
grades[500]=12345
</pre>

<p>
The reason this is dangerous, is that <b>only 20 bytes of memory were
set aside for the array</b> yet we are writing to locations in memory
that are outside of these boundaries. The location in memory that is
24 bytes beyond the start of the <code>grades</code> array (the location accessed
by the expression <code>grades[5]</code>), and the location in memory that is
2004 bytes beyond the start of the array (the location accessed by the
expression <code>grades[500]</code>), have not been set aside for the <code>grades</code>
array, and <b>these locations in memory may be used to store other
important things</b>. They may correspond to some other variable in your
program, or they may be storing some information that's not even part
of your program at all, but is part of the operating system &#x2014; for
example some part of the OS that is controlling the hard disk, or the
video screen, or the network, or the fans, etc. By <b>writing your data</b>
in memory locations that are not within the bounds of memory that has
been set aside by you, <b>anything can happen</b>.
</p>

<p>
One example: imagine you are writing a C program to control a robot
arm (as we do in experiments in our lab). What do you think would
happen if suddenly you over-wrote some random location in memory?
Answer: nothing good!
</p>
</div>
</div>

<div id="outline-container-orge58da9e" class="outline-3">
<h3 id="orge58da9e">Initializing Arrays</h3>
<div class="outline-text-3" id="text-orge58da9e">
<p>
In general, we can initialize values of an array using curly brackets <code>{}</code> like this:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">5</span><span style="color: #4f97d7;">]</span> = <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">}</span>;
</pre>
</div>

<p>
This says allocate the <code>grades</code> array to hold 5 values, and assign <code>4</code>
to the first value, <code>3</code> to the second value, <code>2</code> to the third value,
<code>5</code> to the fourth value, and <code>1</code> to the 5th value.
</p>

<p>
We can initialize specific values (and not others) like this:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span> = <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span>=<span style="color: #a45bad;">1</span>, <span style="color: #2d9574;">[</span><span style="color: #a45bad;">2</span><span style="color: #2d9574;">]</span>=<span style="color: #a45bad;">3</span>, <span style="color: #2d9574;">[</span><span style="color: #a45bad;">4</span><span style="color: #2d9574;">]</span>=<span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">}</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">5</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"grades[%d]=%d\n"</span>, i, grades<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
grades[0]=1
grades[1]=0
grades[2]=3
grades[3]=0
grades[4]=5
</pre>

<p>
This says initialize the 0th (the first) element of the array to
contain the integer <code>1</code>, set the third element (<code>grades[2]</code>) to
contain the integer <code>3</code>, and set the fifth element (<code>grades[4]</code>) to
contain the integer <code>5</code>. <b>All other elements</b> are set to zero.
</p>
</div>
</div>
</div>
