org/6_Complex_Data_Types.org
* Multidimensional Arrays

We have seen single-dimensional arrays. C provides for
multi-dimensional arrays as well. Here is how we can define a
two-dimensional array of integers, initialize values, and index into
it to read off values:

#+BEGIN_SRC c
#include <stdio.h>

int main ()
{
  int grades[2][2] = {1,2,3,4};
  int i,j;
  for (i=0; i<2; i++) {
    for (j=0; j<2; j++) {
      printf("grades[%d][%d]=%d\n", i, j, grades[i][j]);
    }
  }
  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
grades[0][0]=1
grades[0][1]=2
grades[1][0]=3
grades[1][1]=4
#+END_EXAMPLE

Here is how we would define a three-dimensional array:

#+BEGIN_SRC c
#include <stdio.h>

int main ()
{
  int grades[2][2][2] = {1,2,3,4,5,6,7,8};
  int i,j,k;
  for (i=0; i<2; i++) {
    for (j=0; j<2; j++) {
      for (k=0; k<2; k++) {
	printf("grades[%d][%d][%d]=%d\n", i, j, k, grades[i][j][k]);
      }
    }
  }
  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
grades[0][0][0]=1
grades[0][0][1]=2
grades[0][1][0]=3
grades[0][1][1]=4
grades[1][0][0]=5
grades[1][0][1]=6
grades[1][1][0]=7
grades[1][1][1]=8
#+END_EXAMPLE

** Matrix Calculations

Although you can use multidimensional arrays to represent matrices, if
you are going to be doing a lot of matrix calculation in your C code,
it will probably be better to make use of one of the pre-existing APIs
for matrix algebra, rather than coding up this stuff yourself. Two
common choices are:

1. The GNU Scientific Library [[http://www.gnu.org/software/gsl/manual/html_node/Vectors-and-Matrices.html][Vectors and Matrices]]
2. [[http://www.netlib.org/lapack/][LAPACK]] (and [[http://www.netlib.org/blas/index.html][BLAS]]) libraries


* Variable-Length Arrays

In the array examples above, we have hard-coded the size of the
array. In modern C (the [[http://en.wikipedia.org/wiki/C99][C99 standard and above]]) it is possible to
declare arrays without knowing until run-time their size.

Here is how to do it:

#+BEGIN_SRC c
#include <stdio.h>

int main (int argc, char *argv[])
{
  if (argc < 2) {
    printf("please provide an integer argument\n");
    return 1;
  }
  else {
    int n = atoi(argv[1]);
    int grades[n];
    int i;
    for (i=0; i<n; i++) {
      grades[i] = i;
    }
    for (i=0; i<n; i++) {
      printf("grades[%d]=%d\n", i, grades[i]);
    }
    return 0;
  }
}
#+END_SRC

#+BEGIN_EXAMPLE
$ ./go 5
grades[0]=0
grades[1]=1
grades[2]=2
grades[3]=3
grades[4]=4
#+END_EXAMPLE

The obvious benefit of allowing variable-length arrays, is that you
don't have to know in advance of your program running, how much memory
to allocate for your array variables. The downside of this, is that
you have to guard against the possibility that your program will
attempt to allocate too much memory.

