html/6_Complex_Data_Types.html

<div id="outline-container-orge2f660a" class="outline-2">
<h2 id="orge2f660a">Multidimensional Arrays</h2>
<div class="outline-text-2" id="text-orge2f660a">
<p>
We have seen single-dimensional arrays. C provides for
multi-dimensional arrays as well. Here is how we can define a
two-dimensional array of integers, initialize values, and index into
it to read off values:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">][</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">]</span> = <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span>,<span style="color: #a45bad;">4</span><span style="color: #bc6ec5;">}</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>,<span style="color: #7590db;">j</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">2</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">(</span>j=<span style="color: #a45bad;">0</span>; j&lt;<span style="color: #a45bad;">2</span>; j++<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      printf<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"grades[%d][%d]=%d\n"</span>, i, j, grades<span style="color: #b1951d;">[</span>i<span style="color: #b1951d;">][</span>j<span style="color: #b1951d;">]</span><span style="color: #67b11d;">)</span>;
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
grades[0][0]=1
grades[0][1]=2
grades[1][0]=3
grades[1][1]=4
</pre>

<p>
Here is how we would define a three-dimensional array:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">][</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">][</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">]</span> = <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span>,<span style="color: #a45bad;">4</span>,<span style="color: #a45bad;">5</span>,<span style="color: #a45bad;">6</span>,<span style="color: #a45bad;">7</span>,<span style="color: #a45bad;">8</span><span style="color: #bc6ec5;">}</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>,<span style="color: #7590db;">j</span>,<span style="color: #7590db;">k</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">2</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">(</span>j=<span style="color: #a45bad;">0</span>; j&lt;<span style="color: #a45bad;">2</span>; j++<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #67b11d;">(</span>k=<span style="color: #a45bad;">0</span>; k&lt;<span style="color: #a45bad;">2</span>; k++<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
  printf<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"grades[%d][%d][%d]=%d\n"</span>, i, j, k, grades<span style="color: #4f97d7;">[</span>i<span style="color: #4f97d7;">][</span>j<span style="color: #4f97d7;">][</span>k<span style="color: #4f97d7;">]</span><span style="color: #b1951d;">)</span>;
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
grades[0][0][0]=1
grades[0][0][1]=2
grades[0][1][0]=3
grades[0][1][1]=4
grades[1][0][0]=5
grades[1][0][1]=6
grades[1][1][0]=7
grades[1][1][1]=8
</pre>
</div>

<div id="outline-container-org40be9cf" class="outline-3">
<h3 id="org40be9cf">Matrix Calculations</h3>
<div class="outline-text-3" id="text-org40be9cf">
<p>
Although you can use multidimensional arrays to represent matrices, if
you are going to be doing a lot of matrix calculation in your C code,
it will probably be better to make use of one of the pre-existing APIs
for matrix algebra, rather than coding up this stuff yourself. Two
common choices are:
</p>

<ol class="org-ol">
<li>The GNU Scientific Library <a href="http://www.gnu.org/software/gsl/manual/html_node/Vectors-and-Matrices.html">Vectors and Matrices</a></li>
<li><a href="http://www.netlib.org/lapack/">LAPACK</a> (and <a href="http://www.netlib.org/blas/index.html">BLAS</a>) libraries</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org3350792" class="outline-2">
<h2 id="org3350792">Variable-Length Arrays</h2>
<div class="outline-text-2" id="text-org3350792">
<p>
In the array examples above, we have hard-coded the size of the
array. In modern C (the <a href="http://en.wikipedia.org/wiki/C99">C99 standard and above</a>) it is possible to
declare arrays without knowing until run-time their size.
</p>

<p>
Here is how to do it:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdlib.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>argc &lt; <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"please provide an integer argument\n"</span><span style="color: #2d9574;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">1</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span> = atoi<span style="color: #2d9574;">(</span>argv<span style="color: #67b11d;">[</span><span style="color: #a45bad;">1</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grades</span><span style="color: #2d9574;">[</span>n<span style="color: #2d9574;">]</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;n; i++<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      grades<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span> = i;
    <span style="color: #2d9574;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;n; i++<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      printf<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"grades[%d]=%d\n"</span>, i, grades<span style="color: #b1951d;">[</span>i<span style="color: #b1951d;">]</span><span style="color: #67b11d;">)</span>;
    <span style="color: #2d9574;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
$ ./go 5
grades[0]=0
grades[1]=1
grades[2]=2
grades[3]=3
grades[4]=4
</pre>

<p>
The obvious benefit of allowing variable-length arrays, is that you
don't have to know in advance of your program running, how much memory
to allocate for your array variables. The downside of this, is that
you have to guard against the possibility that your program will
attempt to allocate too much memory.
</p>
</div>
</div>
