org/6_Complex_Data_Types.org
* Command-line arguments

The example above also illustrates how to pass command-line arguments
to your C programs. The =main()= function can be defined using two
arguments, =int argc= and =char *argv[]=. When your program is
executed, the first argument =argc=, will contain the *number of
command-line arguments passed to your program, plus one*. The first
argument is always the name of your program. So in the example above,
we check to see if =argc<2= because we want at least one extra
argument passed to our program in addition to the automatic program
name argument.

The second argument =argv= is a one-dimensional array of strings. As
we will see later, the =(char *)= data type, which is actually a
pointer to a character, is typically used in C to represent strings
(as an array of characters).

In the example above, we use the =atoi()= function to convert *ascii*
to *integer*, in order to convert the command-line argument (the
second one, hence =argv[1]=) which is an ascii string, into an integer
=n=. We then declare an array =grades[n]= to be of length =n=.

Here is some code that does nothing except output to the screen the
number of input arguments, and their value:

#+BEGIN_SRC C
#include <stdio.h>
    
int main(int argc, char* argv[]) {
  char** argp;
  int i;
  printf("argc = %d\n", argc);
  for (i=0; i<argc; i++) {
    printf("argv[%d] = %s\n", i, argv[i]);
  }
  return 0;
}
#+END_SRC C

So for example:

#+BEGIN_EXAMPLE
plg:Desktop plg$ gcc -o dryrun dryrun.c
plg:Desktop plg$ ./dryrun
argc = 1
argv[0] = ./dryrun
plg:Desktop plg$ 
plg:Desktop plg$ ./dryrun hello
argc = 2
argv[0] = ./dryrun
argv[1] = hello
plg:Desktop plg$ 
plg:Desktop plg$ ./dryrun 1 2 3 hi "the dude" 3.14159
argc = 7
argv[0] = ./dryrun
argv[1] = 1
argv[2] = 2
argv[3] = 3
argv[4] = hi
argv[5] = the dude
argv[6] = 3.14159
#+END_EXAMPLE

Remember, all inputs are treated as null-terminated strings, so if you
want to pass integers or floating point values in, you will have to
convert them from strings in your code. Also remember that the first
argument is always the name of the program, so if you expect to have
to pass =n= input arguments to your program, then expect =argc= to be
=n+1=.

* Structures

Structures are another way of grouping together different elements of
data, into one named variable. Unlike arrays, in which all elements
have to be of the same type, in structures, you can store any
combination of any data types you want. Structures can even contain
other structures.

Here is what a structure definition looks like:

#+BEGIN_SRC C
struct Point 3D{
  int x;
  int y;
  int z;
};
#+END_SRC

The =struct= keyword tells the compiler that what's coming next is a
structure. Here I have named the data type =Point3D= and I have
defined this structure as containing three integer variables, named
=x=, =y= and =z=.

Here is how to use our new structure in a program:

#+BEGIN_SRC C
#include <stdio.h>

int main ()
{

  struct Point3D {
    int x;
    int y;
    int z;
  };

  struct Point3D p1;
  p1.x = 0;
  p1.y = 0;
  p1.z = 0;

  struct Point3D p2 = {.x=1, .y=2, .z=3};

  printf("p1 = (%d,%d,%d) and p2 = (%d,%d,%d)\n", p1.x, p1.y, p1.z, p2.x, p2.y, p2.z);

  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
p1 = (0,0,0) and p2 = (1,2,3)
#+END_EXAMPLE

** Using typedef to shorten structure declarations

We saw before how to use =typedef= to define new names for data
types. We can take advantage of this trick to shorten how we declare
structure variables. Using typedef to define our structure, we can
avoid having to use the =struct= keyword every time we declare a new
variable that is our structure type:

#+BEGIN_SRC C
#include <stdio.h>

int main ()
{

typedef struct {
    int x;
    int y;
    int z;
  }  Point3D;

  Point3D p1;
  p1.x = 0;
  p1.y = 0;
  p1.z = 0;

  Point3D p2 = {.x=1, .y=2, .z=3};

  printf("p1 = (%d,%d,%d) and p2 = (%d,%d,%d)\n", p1.x, p1.y, p1.z, p2.x, p2.y, p2.z);

  return 0;
}
#+END_SRC

