html/6_Complex_Data_Types.html

<div id="outline-container-orgf0645bf" class="outline-2">
<h2 id="orgf0645bf">Command-line arguments</h2>
<div class="outline-text-2" id="text-orgf0645bf">
<p>
The example above also illustrates how to pass command-line arguments
to your C programs. The <code>main()</code> function can be defined using two
arguments, <code>int argc</code> and <code>char *argv[]</code>. When your program is
executed, the first argument <code>argc</code>, will contain the <b>number of
command-line arguments passed to your program, plus one</b>. The first
argument is always the name of your program. So in the example above,
we check to see if <code>argc&lt;2</code> because we want at least one extra
argument passed to our program in addition to the automatic program
name argument.
</p>

<p>
The second argument <code>argv</code> is a one-dimensional array of strings. As
we will see later, the <code>(char *)</code> data type, which is actually a
pointer to a character, is typically used in C to represent strings
(as an array of characters).
</p>

<p>
In the example above, we use the <code>atoi()</code> function to convert <b>ascii</b>
to <b>integer</b>, in order to convert the command-line argument (the
second one, hence <code>argv[1]</code>) which is an ascii string, into an integer
<code>n</code>. We then declare an array <code>grades[n]</code> to be of length <code>n</code>.
</p>

<p>
Here is some code that does nothing except output to the screen the
number of input arguments, and their value:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"argc = %d\n"</span>, argc<span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;argc; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"argv[%d] = %s\n"</span>, i, argv<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
So for example:
</p>

<pre class="example">
plg:Desktop plg$ gcc -o dryrun dryrun.c
plg:Desktop plg$ ./dryrun
argc = 1
argv[0] = ./dryrun
plg:Desktop plg$ 
plg:Desktop plg$ ./dryrun hello
argc = 2
argv[0] = ./dryrun
argv[1] = hello
plg:Desktop plg$ 
plg:Desktop plg$ ./dryrun 1 2 3 hi "the dude" 3.14159
argc = 7
argv[0] = ./dryrun
argv[1] = 1
argv[2] = 2
argv[3] = 3
argv[4] = hi
argv[5] = the dude
argv[6] = 3.14159
</pre>

<p>
Remember, all inputs are treated as null-terminated strings, so if you
want to pass integers or floating point values in, you will have to
convert them from strings in your code. Also remember that the first
argument is always the name of the program, so if you expect to have
to pass <code>n</code> input arguments to your program, then expect <code>argc</code> to be
<code>n+1</code>.
</p>
</div>
</div>

<div id="outline-container-org9b922d5" class="outline-2">
<h2 id="org9b922d5">Structures</h2>
<div class="outline-text-2" id="text-org9b922d5">
<p>
Structures are another way of grouping together different elements of
data, into one named variable. Unlike arrays, in which all elements
have to be of the same type, in structures, you can store any
combination of any data types you want. Structures can even contain
other structures.
</p>

<p>
Here is what a structure definition looks like:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Point3D</span><span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">y</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">z</span>;
<span style="color: #4f97d7;">}</span>;
</pre>
</div>

<p>
The <code>struct</code> keyword tells the compiler that what's coming next is a
structure. Here I have named the data type <code>Point3D</code> and I have
defined this structure as containing three integer variables, named
<code>x</code>, <code>y</code> and <code>z</code>.
</p>

<p>
Here is how to use our new structure in a program:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>

  <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Point3D</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">y</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">z</span>;
  <span style="color: #bc6ec5;">}</span>;

  <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Point3D</span> <span style="color: #7590db;">p1</span>;
  p1.x = <span style="color: #a45bad;">0</span>;
  p1.y = <span style="color: #a45bad;">0</span>;
  p1.z = <span style="color: #a45bad;">0</span>;

  <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Point3D</span> <span style="color: #7590db;">p2</span> = <span style="color: #bc6ec5;">{</span>.x=<span style="color: #a45bad;">1</span>, .y=<span style="color: #a45bad;">2</span>, .z=<span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">}</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"p1 = (%d,%d,%d) and p2 = (%d,%d,%d)\n"</span>, p1.x, p1.y, p1.z, p2.x, p2.y, p2.z<span style="color: #bc6ec5;">)</span>;

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
p1 = (0,0,0) and p2 = (1,2,3)
</pre>
</div>

<div id="outline-container-orgb76e4e3" class="outline-3">
<h3 id="orgb76e4e3">Using typedef to shorten structure declarations</h3>
<div class="outline-text-3" id="text-orgb76e4e3">
<p>
We saw before how to use <code>typedef</code> to define new names for data
types. We can take advantage of this trick to shorten how we declare
structure variables. Using typedef to define our structure, we can
avoid having to use the <code>struct</code> keyword every time we declare a new
variable that is our structure type:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>

<span style="color: #4f97d7; font-weight: bold;">typedef</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">y</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">z</span>;
  <span style="color: #bc6ec5;">}</span>  <span style="color: #ce537a; font-weight: bold;">Point3D</span>;

  <span style="color: #ce537a; font-weight: bold;">Point3D</span> <span style="color: #7590db;">p1</span>;
  p1.x = <span style="color: #a45bad;">0</span>;
  p1.y = <span style="color: #a45bad;">0</span>;
  p1.z = <span style="color: #a45bad;">0</span>;

  <span style="color: #ce537a; font-weight: bold;">Point3D</span> <span style="color: #7590db;">p2</span> = <span style="color: #bc6ec5;">{</span>.x=<span style="color: #a45bad;">1</span>, .y=<span style="color: #a45bad;">2</span>, .z=<span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">}</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"p1 = (%d,%d,%d) and p2 = (%d,%d,%d)\n"</span>, p1.x, p1.y, p1.z, p2.x, p2.y, p2.z<span style="color: #bc6ec5;">)</span>;

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
