org/6_Complex_Data_Types.org
** Structures Containing Arrays

As we have seen, structures can contain any combination of any data
types you wish. Here is an example of a structure that contains a
couple of integers, and an array of floating-point values (doubles).

#+BEGIN_SRC C
#include <stdio.h>

int main ()
{

typedef struct {
    int a;
    int b;
    double myVector[5];
  }  myStruct;
 
 myStruct s1;

 s1.a = 10;
 s1.b = 20;
 int i;
 for (i=0; i<5; i++) {
   s1.myVector[i] = i;
 }

 return 0;
}
#+END_SRC


** Arrays of Structures

We have seen how to use arrays to store numeric data types. Arrays can
also be used to store structures. Here we use an array to store 10 of
our =Point3D= structure data types:

#+BEGIN_SRC C
#include <stdio.h>

int main ()
{

typedef struct {
    int x;
    int y;
    int z;
  }  Point3D;

  Point3D myPoints[10];
  int i;
  for (i=0; i<10; i++) {
    myPoints[i].x = i;
    myPoints[i].y = i;
    myPoints[i].z = i;
  }

  return 0;
}
#+END_SRC


