html/6_Complex_Data_Types.html

<div id="outline-container-org2d42bec" class="outline-3">
<h3 id="org2d42bec">Structures Containing Arrays</h3>
<div class="outline-text-3" id="text-org2d42bec">
<p>
As we have seen, structures can contain any combination of any data
types you wish. Here is an example of a structure that contains a
couple of integers, and an array of floating-point values (doubles).
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>

<span style="color: #4f97d7; font-weight: bold;">typedef</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>;
    <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">myVector</span><span style="color: #2d9574;">[</span><span style="color: #a45bad;">5</span><span style="color: #2d9574;">]</span>;
  <span style="color: #bc6ec5;">}</span>  <span style="color: #ce537a; font-weight: bold;">myStruct</span>;

 <span style="color: #ce537a; font-weight: bold;">myStruct</span> <span style="color: #7590db;">s1</span>;

 s1.a = <span style="color: #a45bad;">10</span>;
 s1.b = <span style="color: #a45bad;">20</span>;
 <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
 <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">5</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
   s1.myVector<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span> = i;
 <span style="color: #bc6ec5;">}</span>

 <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org89c8410" class="outline-3">
<h3 id="org89c8410">Arrays of Structures</h3>
<div class="outline-text-3" id="text-org89c8410">
<p>
We have seen how to use arrays to store numeric data types. Arrays can
also be used to store structures. Here we use an array to store 10 of
our <code>Point3D</code> structure data types:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>

<span style="color: #4f97d7; font-weight: bold;">typedef</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">y</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">z</span>;
  <span style="color: #bc6ec5;">}</span>  <span style="color: #ce537a; font-weight: bold;">Point3D</span>;

  <span style="color: #ce537a; font-weight: bold;">Point3D</span> <span style="color: #7590db;">myPoints</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">10</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i=<span style="color: #a45bad;">0</span>; i&lt;<span style="color: #a45bad;">10</span>; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    myPoints<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span>.x = i;
    myPoints<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span>.y = i;
    myPoints<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span>.z = i;
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
